In [46]:
# import libraries
import pandas as pd
import sqlite3


import numpy as np
from numpy import std, mean, sqrt
import scipy.stats as stats
from statsmodels.stats.power import tt_ind_solve_power
import statsmodels.api as sm
from statsmodels.formula.api import ols

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [47]:
# connect to database
conn = sqlite3.Connection('Northwind_large.sqlite')
cur = conn.cursor()

In [48]:
#what tables are available in the database
cur.execute("""SELECT name 
               FROM sqlite_master
               WHERE type = 'table';""")
cur.fetchall()

[('Employee',),
 ('Category',),
 ('Customer',),
 ('Shipper',),
 ('Supplier',),
 ('Order',),
 ('Product',),
 ('OrderDetail',),
 ('CustomerCustomerDemo',),
 ('CustomerDemographic',),
 ('Region',),
 ('Territory',),
 ('EmployeeTerritory',),
 ('sqlite_sequence',)]

In [49]:
# OrderDetail data


cur.execute("""SELECT Id AS EmployeeID, LastName AS Name, City, Country,Region,HireDate as hiredate
               FROM Employee
               """)
df_Employee = pd.DataFrame(cur.fetchall())
df_Employee.columns = [x[0] for x in cur.description]
df_Employee.sample(9)

   EmployeeID       Name      City Country         Region    hiredate
4           5   Buchanan    London      UK  British Isles  2025-10-17
3           4    Peacock   Redmond     USA  North America  2025-05-03
1           2     Fuller    Tacoma     USA  North America  2024-08-14
0           1    Davolio   Seattle     USA  North America  2024-05-01
6           7       King    London      UK  British Isles  2026-01-02
5           6     Suyama    London      UK  British Isles  2025-10-17
2           3  Leverling  Kirkland     USA  North America  2024-04-01
8           9  Dodsworth    London      UK  British Isles  2026-11-15
7           8   Callahan   Seattle     USA  North America  2026-03-05

### Manage n/a data types<a id='Manage n/a data types'></a>

In [50]:
# nans identification
print(len(df_Employee))
df.isna().sum()

9

EmployeeID    0
Name          0
City          0
Country       0
Region        0
hiredate      0
dtype: int64

### Remove duplicate data<a id='Remove duplicate data'></a>

In [54]:
# identification of duplicate data
print('duplicated rows: ' + str(df_Employee.duplicated().sum()))

duplicated rows: 0

# vacio

In [ ]:
df_Employee.columns = df_Employee.columns.str.strip()

### Manage data types<a id='Manage data types'></a>

In [52]:
# data type identification
df_Employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  9 non-null      int64
 1   Name        9 non-null      object
 2   City        9 non-null      object
 3   Country     9 non-null      object
 4   Region      9 non-null      object
 5   hiredate    9 non-null      object
dtypes: int64(1), object(5)
memory usage: 560.0+ bytes

### Remove outliers<a id='Remove outliers'></a>

In [38]:
df_Employee.describe()

       EmployeeID
count    9.000000
mean     5.000000
std      2.738613
min      1.000000
25%      3.000000
50%      5.000000
75%      7.000000
max      9.000000

In [53]:
df_Employee.to_csv(r'Employee.csv')